package tasks;

public class task2_4 implements sub_task{

}
//Сотрудники и отделы. Создайте сущность Сотрудник, которая описывается именем (в строковой форме) и
//отделом, в котором сотрудник работает, причем у каждого отдела есть название и начальник, который
//также является Сотрудником. Сотрудник может быть приведен к текстовой форме вида: “Имя работает в
//отделе Название, начальник которого Имя”. В случае если сотрудник является руководителем отдела, то
// текстовая форма должна быть “Имя начальник отдела Название”. Необходимо выполнить следующие задачи:
//Создать Сотрудников Петрова, Козлова, Сидорова работающих в отделе IT.
//Сделать Козлова начальником IT отдела.
//Вывести на экран текстовое представление всех трех Сотрудников (у всех троих должен оказаться
// один и тот же отдел и начальник).