package tasks;

public class task1_3 implements sub_task {

}
// Имена. Создайте сущность Имя, которая описывается тремя параметрами: Фамилия, Личное имя, Отчество.
// Имя может быть приведено к строковому виду, включающему традиционное представление всех трех параметров:
// Фамилия Имя Отчество (например “Иванов Иван Иванович”). Необходимо предусмотреть возможность того, что
// какой-либо из параметров может быть не задан, и в этом случае он не учитывается при приведении
// к текстовому виду. Необходимо создать следующие имена:
// • Клеопатра • Пушкин Александр Сергеевич • Маяковский Владимир Обратите внимание,
// что при выводе на экран, не заданные параметры никак не участвуют в образовании строки.