package tasks;

public class task4_5 implements sub_task{

}
//Создаем Имена. Измените сущность Имя из задачи 1.3. Новые требования включают:
// • Имя можно создать указав только Личное имя • Имя можно создать указав Личное имя и Фамилию.
// • Имя можно создать указав все три параметра: Личное имя, Фамилию, Отчество. Необходимо создать
// следующие имена:
//
//Клеопатра
//Александр Сергеевич Пушкин
//Владимир Маяковский
//Христофор Бонифатьевич (здесь Христофор это имя, а Бонифатьевич - фамилия)